{
  "articles": [
    {
      "id": 1,
      "title": "Una caja maliciosa de Rust distribuye malware específico del sistema operativo a los sistemas de desarrolladores Web3.",
      "content": "Investigadores de ciberseguridad han descubierto un paquete Rust malicioso que puede atacar sistemas Windows, macOS y Linux y que cuenta con una funcionalidad maliciosa para ejecutarse sigilosamente en máquinas de desarrolladores haciéndose pasar por una herramienta auxiliar de unidad de máquina virtual Ethereum (EVM). El paquete de Rust, llamado 'evm-units', fue subido a crates.io a mediados de abril de 2025 por el usuario 'ablerust', y recibió más de 7000 descargas en los últimos ocho meses. Otro paquete creado por el mismo autor, 'uniswap-utils', incluía 'evm-units' como dependencia. Se descargó más de 7400 veces. Desde entonces, los paquetes se han eliminado del repositorio. Según el sistema operativo de la víctima y si el antivirus Qihoo 360 está activo, el paquete descarga una carga útil, la escribe en el directorio temporal del sistema y la ejecuta silenciosamente, explicó la investigadora de seguridad de Socket, Olivia Brown, en un informe. 'El paquete parece devolver el número de versión de Ethereum, por lo que la víctima no se da cuenta'. Un aspecto notable del paquete es que está diseñado explícitamente para verificar la presencia del proceso 'qhsafetray.exe', un archivo ejecutable asociado con 360 Total Security, un software antivirus desarrollado por el proveedor de seguridad chino Qihoo 360. Específicamente, el paquete está diseñado para invocar una función aparentemente inofensiva llamada 'get_evm_version()', que decodifica y accede a una URL externa ('download.videotalks[.]xyz') para obtener una carga útil de la siguiente etapa dependiendo del sistema operativo en el que se esté ejecutando. En Linux, descarga un script, lo guarda en /tmp/init y lo ejecuta en segundo plano utilizando el comando nohup, lo que permite al atacante obtener control total. En macOS, descarga un archivo llamado init y lo ejecuta usando osascript en segundo plano con el comando nohup. En Windows, descarga y guarda la carga útil como un archivo de script de PowerShell ('init.ps1') en el directorio temporal y verifica los procesos en ejecución en busca de 'qhsafetray.exe' antes de invocar el script. Si el proceso no está presente, crea un contenedor de script de Visual Basic que ejecuta un script de PowerShell oculto sin ventana visible. Si se detecta el proceso antivirus, modifica ligeramente su flujo de ejecución invocando directamente PowerShell. 'Este enfoque en Qihoo 360 es un indicador poco común y explícito de una estrategia dirigida a China, ya que se trata de una empresa china líder en internet', afirmó Brown. 'Encaja con el perfil de robo de criptomonedas, ya que Asia es uno de los mayores mercados globales para la actividad minorista de criptomonedas'. Las referencias a EVM y Uniswap, un protocolo de intercambio de criptomonedas descentralizado creado en la cadena de bloques Ethereum, indican que el incidente de la cadena de suministro está diseñado para apuntar a los desarrolladores en el espacio Web3 haciendo pasar los paquetes como utilidades relacionadas con Ethereum. 'Ablerust, el actor de amenazas responsable del código malicioso, integró un cargador multiplataforma de segunda etapa dentro de una función aparentemente inofensiva', declaró Brown. 'Peor aún, la dependencia se integró en otro paquete ampliamente utilizado (uniswap-utils), lo que permitió que el código malicioso se ejecutara automáticamente durante la inicialización'.",
      "category": "Malware",
      "source": "The Hacker News",
      "date": "2025-12-03",
      "image": "https://8upload.com/image/d42511bdf8da6870/IMG_20251203_041541_676.jpg",
      "url": "https://thehackernews.com"
    }
  ]
}
